//*********************************************************************************
// Сокращенные арифметические формы +=, -= и т д. | C++ для начинающих | Урок #10
// --------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// --------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*********************************************************************************

#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");

	// =1=
	int a = 0;
	a++;
	a--;

	// =2=  
	a = a + 20;
	a += 20;

	a = a - 10;
	a -= 10;

	a = a * 2;
	a *= 2;

	a = a / 2;

	a /= 2;

	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
