//***********************************************************************************************************
// argc argv c++ что это. Параметры функции main argc argv. Аргументы main. | C++ для начинающих | Урок #70
// ----------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ----------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//***********************************************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*-----------------------------------------------------
* int argc, char* argv[]
* argument count (argc) - кол-во параметров
* argument value (argv) - строковый массив параметров
------------------------------------------------------*/

int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	// 1-й аргумент - всегда имя главной программы
	for (int i = 0; i < argc; i++)
	{
		cout << "  " << i << "\t" << argv[i] << endl;
	}

	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}