//********************************************************************************************
// Цикл for. Что это. Что делает. Пример. Синтаксис. Циклы. | C++ для начинающих | Урок #16
// -------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************************************************

#include <iostream>

using namespace std;

// Цикл for

int main()
{
	setlocale(LC_ALL, "ru");

	for (int i = 2; i < 13; i++)
	{
		cout << " Переменная i = " << i << endl;
	}

	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
