//**************************************************************
// Escape - последовательности | C++ для начинающих | Урок #3
//--------------------------------------------------------------
// С++ | Visual Studio 2022 
//--------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//**************************************************************

#include <iostream>
#include <string>
#include <clocale>

using namespace std;

/*---------------------------------------------------

	\b - Удаление последнего выведенного символа
	\n - Перейти на начало новой строки
	\t - Перейти к след. позиции табуляции

/////////////////////////////////////////////////////

	\\ - Вывести обратную черту (\)
	\" - Вывести двойную кавычку (")
	\' - Вывести одинарную кавычку (')

---------------------------------------------------*/


int main()
{
	setlocale(LC_ALL, "Rus");

	/* ... */
	cout << " \n \"Привет!\"\n";

	//=== END ===
	cout << endl;
	cin.get();
	return 0;

}
