//*************************************************************************************************************
// Ключевое слово continue c++ что это. Оператор continue. Пример. Синтаксис. | C++ для начинающих | Урок #19
// ------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*************************************************************************************************************

#include <iostream>

using namespace std;

/* Ключевое слово continue */

int main()
{
	setlocale(LC_ALL, "ru");

	for (int i = 0; i < 5; i++)
	{
		if (i == 2)
		{
			continue;
		}
		cout << "переменная i: " << i << endl;
	}

	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
