//********************************************************************************************************************
// Препроцессор что это. Директива #define. Макросы. Директивы препроцессора что это. | C++ для начинающих | Урок #10
// -------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************************************************************************

#include <iostream>
#include "utils.h"

#define PI 3.14
#define tab "\t"

/*
#define begin {
#define end }
*/

using namespace std;

/*
	Препроцесоор
	#define
*/

int main()
{
	setlocale(LC_ALL, "ru");

	cout << PI << endl;
	cout << "text\ttext (code)" << endl;
	cout << "text" << tab << "text (tab)" << endl;

	/*
	for (int i = 0; i < 5; i++)
	begin
		cout << i << endl;
	end
	*/

	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
