//***********************************************************************************************************************
// sizeof что это. sizeof c++ массив. Узнать количество элементов массива. sizeof array. | C++ для начинающих | Урок #28
// ----------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ----------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//***********************************************************************************************************************
/* sizeof */
/* для типа данных или переменной */

#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");

	int a;

	cout << "INT: " << sizeof(int) << " bytes" << endl;
	cout << "DOUBLE: " << sizeof(double) << " bytes" << endl;
	cout << sizeof(a) << endl;

	cout << endl;
	system("pause");
	return 0;
}

