//*********************************************************************************************************************
// Функции c++ примеры. Синтаксис. Объявление, реализация функции. 
// Параметры, аргументы. | C++ для начинающих | Урок #33
// --------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// --------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*********************************************************************************************************************

#include <iostream>
#include <ctime>

using namespace std;

/*----------------------------------------
	возвращаемое_значение имя (параметры)
	{
		код функции...
	}
-----------------------------------------*/

int foo(int);
void foo2(int);
int sum(int, int);

/*************************
		   MAIN
**************************/

int main(int argc, const char* argv[])
{
	setlocale(LC_ALL, "ru");

	srand(time(NULL));
	cout << "RAND = " << rand() << endl;

	for (int i = 0; i < 5; i++)
	{
		foo(i);
		foo2(i);
	}

	int a = 1, b = 2;
	int c = sum(a, b);
	cout << " C = " << c << endl;


	//=== END ===
	cout << endl;
	system("pause");
	return 0;
}

/*************************
		 FUNTIONS
**************************/

// --- foo ---
int foo(int i)
{
	cout << "foo(): Я функция. Меня вызвали! - " << i << endl;
	return 0;
}

// --- foo2 ---
void foo2(int n)
{
	cout << "\tfoo2(): Test function! - " << n << endl;
}

// --- sum ---
int sum(int a, int b)
{
	int result = a + b;
	cout << "///////////////////////////////////" << endl;
	cout << "\tSUM: RESULT = " << result << endl;
	cout << "///////////////////////////////////" << endl;
	return result;
}
