//********************************************************************************
// Операторы. Арифметические операции с числами. | C++ для начинающих | Урок #8
// -------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************************************

#include <iostream>

using namespace std;

/*
 * ОПЕРАТОРЫ:
 *  - унарные
 *  - бинарные
 *  - тернарные
 */

int main()
{
	setlocale(LC_ALL, "Rus");

	// УНАРНЫЕ
	int x = 5;
	cout << x << endl;

	x = -x;
	cout << x << endl;

	// БИНАРНЫЕ 
	int a = 5, b = 2, c;
	c = a + b;

	cout << c << endl;
	cout << a * b << endl;

	// приоритет 
	c = 2 + 2 * 2;
	cout << c << endl;

	c = (2 + 2) * 2;
	cout << c << endl;

	// ТЕРНАРНЫЕ


	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
