//****************************************************************************************************
// Область видимости. Глобальные переменные и локальные переменные. | C++ для начинающих | Урок #37
// ---------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022
// ---------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//****************************************************************************************************

#include <iostream>

using namespace std;

/*
	Область видимости
	Глобальные переменные и локальные переменные
*/

int value = 0;		// глобальная переменная (вне видимости всех областей) - инициализируется по умолчанию нулём  

void foo()
{
	int z = 0;		// локальнаа переменная функции 
	value = 1;		// глобальная переменная
}


int main()
{
	setlocale(LC_ALL, "ru");

	int b;			// local var for main filed (инициализируется по умолчанию "муcором")

	if (true)
	{
		int a = 0;	// локальная переменная в области видимости блока if 
		b = 1;		// local var (from main)	
		cout << "(if) local a = " << a << endl;
		cout << "(if) local b = " << b << endl;
	}

	int a = 123;
	b = 2;
	cout << "(main) local a = " << a << endl;
	cout << "(main) local b = " << b << endl;

	// ограничение области видимомсти
	{
		int v = 123;
	}

	// v = 234; // переменная не видна 
	value = 2;	// глобальная переменная


	//=== END ===
	cout << endl;
	system("pause");
	return 0;
}
