//*******************************************************************************************************
// Switch. Что это. Пример. Синтаксис. Оператор множественного выбора. | C++ для начинающих | Урок #13
// ------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*******************************************************************************************************

#include <iostream>

using namespace std;

// Оператор множественного выбора 

int main()
{
	setlocale(LC_ALL, "Rus");

	int a;
	cout << "Введите чиcло: ";
	cin >> a;

	switch (a)
	{
	case 1:
		cout << "Вы ввели 1" << endl;
		break;

	case 2:
		cout << "Вы ввели 2" << endl;
		break;

	default:
		cout << "Я не знаю этого числа!" << endl;
		break;
	}

	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
