//****************************************************************************************************************
// Константные аргументы функции. Константный указатель. Константные параметры. | C++ для начинающих | Урок #57
// ---------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ---------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//****************************************************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*
 *   Как скопировать динамический массив С++
 */

 // const не позволяет именять парамерты внутри функции

 /*-----------------------------
	 Заполнить дин. массив
 ------------------------------*/
void FillArray(int* const arr, const int size, const int max)
{
	srand(time(NULL));							// уcтановить счётчик для rand() 
	for (int i = 0; i < size; i++)
	{
		arr[i] = rand() % max;					// диапазон 0..num
	}
}


/*-----------------------------
	 Вывести дин. массив
------------------------------*/
void ShowArray(int* const arr, const int size)
{
	cout << endl;
	for (int i = 0; i < size; i++)
	{
		cout << "  " << arr[i] << "\t";
	}
	cout << endl << endl;
}


int main()
{
	setlocale(LC_ALL, "ru");

	int size = 5, max = 100;
	int* arr = new int[size];

	FillArray(arr, size, max);
	ShowArray(arr, size);


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}