//*******************************************************************************************************************
// Двумерные массивы вывод. Заполнение. Двумерный массив циклы. C++ для начинающих. | C++ для начинающих | Урок #32
// -----------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*******************************************************************************************************************

#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");

	const int ROWS = 5; // колонки
	const int COLS = 8; // столбцы

	int arr[ROWS][COLS]{};				// ициализация нуля

	/* -- Заполнение -- */
	for (int i = 0; i < ROWS; i++)
	{
		for (int j = 0; j < COLS; j++)
		{
			arr[i][j] = rand() % 10;	// случайное чило 1...10
		}
	}

	/* -- Вывод -- */
	for (int i = 0; i < ROWS; i++)      // Столбцы массива
	{
		for (int j = 0; j < COLS; j++)  // Cторка массива
		{
			cout << arr[i][j] << "\t";
		}
		cout << endl;
	}

	system("pause");
	return 0;
}
