//***********************************************************************************
// Что такое вложенный цикл. Вложенная конструкция. | C++ для начинающих | Урок #24
//-----------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
//-----------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//***********************************************************************************

#include <iostream>

using namespace std;

/* вложенные циклы */

int main()
{
	setlocale(LC_ALL, "ru");

	for (int i = 1; i < 5; i++)
	{
		cout << "сработал 1-й цикл for итерация i =  " << i << endl;
		for (int j = 0; j < 5; j++)
		{
			cout << "\tсработал 2-й цикл for итерация j =  " << j << endl;
		}
	}

	//=== END ===
	cout << endl;
	system("pause");
	return 0;
}
