//****************************************************************************************************
// c++ макрос функция. Макросы с аргументами. Макрос с параметрами. | C++ для начинающих | Урок #67
// ---------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ---------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//****************************************************************************************************

#include <iostream>
#include "utils.h"

// МАКРОС
#define FOO(x,y) ((x)*(y))			

using namespace std;

/*
	Препроцессор
	#define
	макрос функция
*/

int main()
{
	setlocale(LC_ALL, "ru");

	cout << FOO(5, 6) << endl;

	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}