//********************************************************************************************************************
// Параметры по умолчанию. Передача аргументов в функцию по умолчанию. 
// Аргументы по умолчанию. | C++ для начинающих | Урок #38
// -------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************************************************************************

#include <iostream>

using namespace std;

/* Аргументы (параметры) по умолчанию */

// --- foo ---
void foo(int q, int a = 5, double b = 0.5)	// Параметер по умолчанию (2-й - игнортруется). Парметры "не поумолчанию" должны быть в начале. 
{
	cout << endl;
	for (int i = 0; i < a; i++)
	{
		cout << "*";
	}
	cout << endl;
}

// *** main ***
int main()
{
	setlocale(LC_ALL, "ru");

	foo(2);				// параметер по умолчанию
	foo(4, 24);			// c аргументом
	foo(4, 10, 1.5);	// c двумя параметрами по умочанию
	foo(4);				// c одним параметром


	//=== END ===
	cout << endl;
	system("pause");
	return 0;
}