//**********************************************************************************************************************
// Visual studio где exe. Как сделать exe файл в visual studio. 
// Как скомпилировать cpp в exe. | C++ для начинающих | Урок #20
// ---------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022
// ---------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//**********************************************************************************************************************
#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");

	cout << "Один" << endl;
	cout << "Два" << endl;
	cout << "Три" << endl;
	cout << "Четыре" << endl;
	cout << "Пять" << endl;

	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
