//**************************************************************************************************
// Двумерный динамический массив c++ пример. Создание, заполнение, удаление. 
// Динамические массивы. | C++ для начинающих | Урок #56
// -------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022
// -------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//**************************************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*
 *     Двумерный динамический массив
 *     это одомернный массив одномерных массивов
 */

int main()
{
	setlocale(LC_ALL, "ru");

	// --- DYN ARRAY 2D ---

	int rows;							// 4 строчки 
	int cols;							// по 5 колонок

	// --- ВВОД РАЗМЕРНОСТИ --- 

	cout << " \nEnter ROWS count: ";
	cin >> rows;

	cout << " \nEnter COLS count: ";
	cin >> cols;

	// --- (1) СОЗДАНИЕ ДВУМЕРНОГО МАССИВА ---

	int** arr = new int* [rows];		// массив указателей на одномерные массивы = 2D массив 
	// delete [] arr;					// освободить память от массива

	for (int i = 0; i < rows; i++)
	{
		arr[i] = new int[cols];			// динамическая память для одномерных массивов (колонки) 
	}

	/////////////////////////////////////////////////

	// --- (2) ЗАПОЛНЕНИЕ МАССИВА --- 

	//srand(time(NULL));						// уcтановить счётчик для rand()
	for (int i = 0; i < rows; i++)
	{
		for (int j = 0; j < cols; j++)
		{
			arr[i][j] = rand() % 20;			// random 1..20
		}
	}

	// --- (3) ВЫВОД ---

	cout << endl;
	for (int i = 0; i < rows; i++)
	{
		for (int j = 0; j < cols; j++)
		{
			cout << arr[i][j] << "\t";			// вывод на console
		}
		cout << endl;							// построчно 
	}

	/////////////////////////////////////////////////

	// --- УДАЛЕНИЕ ДВУМЕРНОГО МАССИВА ---

	for (int i = 0; i < rows; i++)
	{
		delete[] arr[i];						// удалить одномерные подмассивы 
	}
	delete[] arr;								// удалить массив "строк"  


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
