//************************************************************************************************************
// C++ для начинающих | Урок #60,#61,#62,#63,#64
// -----------------------------------------------------------------------------------------------------------
// 0060 Строки в с++. Нуль терминатор. Что такое строка в с++. char c++ массив. С++ Для начинающих. Урок #60
// 0061 Приведение типов в стиле с. Явное и неявное преобразование типов.Преобразование типов.С++ Урок #61
// 0062 Что такое ascii символы.ascii что это такое_ Таблица ascii c++.C ++ Для начинающих. Урок #62
// 0063 Указатели символьные строки и функции.Строки и указатели в c++.C ++ Для начинающих. Урок #63
// 0064 Конкатенация строк что это.Объединение строк.Тип данных string c++ что это. Урок #64
// -----------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//************************************************************************************************************

#include <iostream>
#include <string>     
#include "utils.h"

using namespace std;

/*
 *    Строки в с++
 *    Строковый массив С++
 *    Таблица символов ASCII
 */

int main()
{
	setlocale(LC_ALL, "ru");

	/* ================= C-ANSI =================*/

	cout << "\n CHAR = " << sizeof(char) << " byte" << endl;
	cout << endl;

	for (int i = 0; i <= 255; i++)
	{
		cout << "code = " << i << "\t" << "char = " << (char)i << endl;
	}

	cout << "\n======================================\n";

	// --- C-ANSI (old) ---

	char result[255]{};
	char str1[255] = "Hello ";
	char str2[255] = "World!";
	//char str1[] = "Hello ";
	//char str2[] = "World!";

	cout << str1 << "\tLEN1 = " << strlen(str1) << endl;   // strlen 
	cout << str2 << "\tLEN2 = " << strlen(str2) << endl;

	strcat_s(result, str1);									// strcat
	strcat_s(result, str2);
	cout << "RESULT1 = " << result << endl;


	/* ================= C++ =================*/

	// --- тип string (new) ---

	// Sample 1
	string s1 = "Hello";
	string s2 = "World";
	string s3 = "!!!";

	string res;
	res = s1 + " " + s2 + " " + s3;
	cout << "RESULT2 = " << res << endl;
	cout << endl;

	// Sample 2
	string t1 = "Мартин";
	string t2 = "Игоревич";
	string t3 = "Дугин";
	string fio;

	fio = "Фамилия: " + t3 + "\tИмя: " + t1 + "\tОтчество: " + t2;
	cout << fio << endl;


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
