//******************************************************************************************************************
// Динамический массив с++ пример. 
// Создание, заполнение, удаление, размер динамического массива | C++ для начинающих | Урок #55
// -----------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//******************************************************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*
	динамический массив
*/

int main()
{
	setlocale(LC_ALL, "ru");

	// -- DYN ARRAY 1D --

	int size = 0;
	cout << "\n  Enter array size: ";
	cin >> size;

	int* arr = new int[size];
	// delete [] arr; // удалить массив

	// Заполнить массив
	srand((unsigned)time(NULL));				// установить генератор случайных чисел
	for (int i = 0; i < size; i++)
	{
		arr[i] = rand() % 100;					// получить случайное число 1..100
	}

	cout << endl;

	// Просмотреть массив
	for (int i = 0; i < size; i++)
	{
		cout << arr + i << ": ";				// адреса на элементы 
		cout << arr[i];							// содержимое элементов (данные)
		cout << " - " << *(arr + i) << endl;
	}


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}