//********************************************************************
// 0010_Abbreviated_arithmetic_forms | C++ для начинающих | Урок #10
// -------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*
	Пeредача параметров по указателю
	Как вернуть два и более значений функции
*/

// Без указателя по значению
void Foo(int aa) // перемнная "a" из main() предана по значению в новую переменную "a" в Foo().
{
	aa++;
}

// С указателем (адресом) 
void Foo2(int* pa, int* pb)
{
	// разменование памяти (содержимое ячеёки памяти)
	// сначала разименовать, потом инкрементировать 
	(*pa)++;
	(*pb) = 555;
}



int main()
{
	setlocale(LC_ALL, "ru");

	// без указаиеля - по значению
	int aa = 0;
	cout << aa << endl;
	Foo(aa);
	cout << aa << endl;

	cout << "\n==================================\n";

	int a = 0, b = 0;
	cout << a << endl;
	Foo2(&a, &b);			// адрес яйчеки памяти со значением переменной  
	cout << a << endl;
	cout << b << endl;



	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
