//**********************************************************************************************************************
// rand. srand. rand задать диапазон. srand time null. 
// Генератора случайных чисел. randomize | C++ для начинающих | Урок #29
// --------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// --------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//**********************************************************************************************************************

#include <iostream>
#include <ctime>

using namespace std;

/* Генератор случайных чилел */

int main()
{
	setlocale(LC_ALL, "ru");

	srand(time(NULL));			// Начальня инициализация для rand(), time() - время в сек. от 01.01.1970 
	cout << "\nВремя в сек. от 01.01.1970: " << time(NULL) << endl << endl;

	/************************************************************************************
	int a;
	// a = rand() % 10;			// Случайное число с ограничением диапазона (1...10)
	a = rand() % 10 + 5;		// Случайное число с ограничением диапазона (5...10)
	cout << a << endl;
	a = rand() % 10 + 5;
	cout << a << endl;
	**************************************************************************************/

	int const SIZE = 10;

	int arr[SIZE];

	for (int i = 0; i < SIZE; i++)
	{
		arr[i] = rand() % 100;			// 1...100
		//arr[i] = rand() % 100 + 5;	// 1...105

	}

	for (int i = 0; i < SIZE; i++)
	{
		cout << "\t Element Array (1...100): " << arr[i] << endl;
	}

	system("pause");
	return 0;
}