//**************************************************************************************************************
// 0023_Debug.cpp: определяет точку входа для консольного приложения.
// 0023_Без этого вы не станете программистом! Найти ошибку в коде. Отладка. Как пользоваться отладчиком #23
// -------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//**************************************************************************************************************

#include <iostream>

using namespace std;

int Sum(int a, int b)
{
	int c = a + b;
	return c;
}

/*-------------------------
 *     О Т Л А Д К А
 --------------------------*/

int main()
{
	setlocale(LC_ALL, "ru");

	int a = 5;
	int b = 6;
	int c;

	c = a + b;
	c = Sum(a, b);

	cout << "Hello World! " << endl;
	cout << "Reult: ";
	cout << c << endl;

	system("pause");
	return 0;
}
