//*******************************************************************************************************************
// new c++ что это. new c++ пример. c++ new delete. 
// delete c++ что это. delete c++ пример. | C++ для начинающих | Урок #10
// ------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*******************************************************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*
	Работа с динамической папмятью.
	Операторы выделения памяти new и delete.
*/

int main()
{
	setlocale(LC_ALL, "ru");

	// -- NEW and DELETE --

	int* pa = new int;		// выделение динамической памяти для int (оператор "NEW")

	*pa = 10;				// поместить в выделенную дин. память содержимое (данные) по адресу в указтеле 

	cout << "\n NEW: " << pa << ": " << *pa << endl;

	delete pa;				// очистить выделенную динамическую память ("DELETE")


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}