//************************************************************************************************
// C++ закрывается консоль. Что делать? Задержка экрана консоли. | C++ для начинающих | Урок #21
// -----------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//************************************************************************************************

#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");

	cout << "Один" << endl;
	cout << "Два" << endl;
	cout << "Три" << endl;
	cout << "Четыре" << endl;
	cout << "Пять" << endl;

	// -1-
	system("pause");

	// -2-
	//int a;
	//cin >> a;

	//-3-
	//cin.get();


	//=== END ===
	//cout << endl;
	//cin.get();
	return 0;
}
