//**************************************************************************************************************
// Логические операции. Операторы сравнения, равенства, объединения, инверсия. | C++ для начинающих | Урок #11
// -------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//**************************************************************************************************************

#include <iostream>

using namespace std;

/*-----------------------------------------
	Операторы сравнения:
	>	-  больше
	<	-  меньше
	>=	-  больше/равно
	<=	-  меньше/равно

	Операторы равенства:
	==	- равно
	!=	- не равно

	Логические операторы:
	&&	- и
	||	- или
	!= 	- не
------------------------------------------*/

int main()
{
	setlocale(LC_ALL, "Rus");

	int a = 3;
	int b = 3;
	int c = 4;

	cout << (4 > 5) << endl;
	cout << (5 == 5) << endl;
	cout << (5 != 5) << endl;
	cout << (a == b) << endl;
	cout << (a == c) << endl;
	cout << (a == b) << endl;

	cout << !(a == b) << endl;	// инверсия
	cout << !(a != b) << endl;

	cout << ((a == b) && (5 > 4) && (1 == 1)) << endl;
	cout << ((3 == 3) || (1 > 0)) << endl;

	//=== etc... ===

	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
