//***************************************************************************************************************
// Что такое null pointer.null c++ что это. nullptr c++ что это. nullptr c++11. | C++ для начинающих | Урок #10
// --------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// --------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//***************************************************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*
	Работа с динамической памятью.
	NULL и nullptr
*/

int main()
{
	setlocale(LC_ALL, "ru");

	// -- NULL POINTER --

	int* pa = new int;		// выделение динамической памяти для int (оператор "NEW")

	*pa = 10;				// поместить в выделенную дин. память содержимое по адресу в указтеле 

	cout << " До delete: " << *pa << endl;

	delete pa;				// очистить выделенную динамическую память ("DELETE")

	// cout << " После delete: " << *pa << endl; // ERROR!

	pa = NULL;				// эквивалентно pa = 0; 

	//cout << " После NULL: " << *pa << endl; // ERROR!


	// -- NULL --
	if (pa != NULL)
	{
		cout << pa << endl;
	}
	delete pa;				// удаление нулевого указателя разрешено

	// nullptr (C++ 11) - отдельный тип данных 
	if (pa != nullptr)
	{
		cout << pa << endl;
	}
	delete pa;

	// 1) delete pa;    - сначала удалить дин.память  
	// 2) pa = nullptr  - потом обнулить указатель 


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
