//********************************************************************************************************
// Условный тернарный оператор что это. Как работает. Как использовать.  | C++ для начинающих | Урок #69
// -------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************************************************************

#include <iostream>
#include "utils.h"

using namespace std;

/*------------------------------------------------
*	Условный тернарный оператор
*   (унарные, бинарные и тернарные операторы)
-------------------------------------------------*/

int main()
{
	setlocale(LC_ALL, "ru");

	int n1 = 5;
	int n2 = 6;

	n1++;						// унарный оператор 
	int s = n1 + n2;			// бинарный оператор

	/*===============================================================*/
	int a;

	cout << "\n Введите значение переменной a: ";
	cin >> a;

	/*
	if (a < 10)
		cout << " a < 10  = " << a << endl;
	else
		if (a > 10)
			cout << " a > 10" << endl;
		else
			cout << " a = 10" << endl;
	*/

	// (a < 10) ? (cout << " a меньше 10  = " << a << endl) : (cout << " a больше 10  = " << a << endl);

	// два тернарных оператора вместе
	(a < 10) ? (cout << " a меньше 10" << endl) : (a > 10) ? (cout << " a больше 10" << endl) : (cout << " a равно 10" << endl);


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}